{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[32mimport \u001b[39m\u001b[36m$ivy.$\u001b[39m"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import $ivy.`org.apache.spark::spark-sql:3.5.6`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[32mimport \u001b[39m\u001b[36mcoursierapi._\u001b[39m"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "// neo4j-spark-connector\n",
    "import coursierapi._\n",
    "interp.repositories() ++= Seq(MavenRepository.of(\"https://repos.spark-packages.org/\"))\n",
    "interp.load.ivy((\"neo4j\" % \"neo4j-spark-connector\" % \"5.3.3-s_2.12\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Spark Session с подключением к Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[32mimport \u001b[39m\u001b[36morg.apache.spark.sql._\u001b[39m"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import org.apache.spark.sql._"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties\n",
      "26/01/13 14:28:34 INFO SparkContext: Running Spark version 3.5.6\n",
      "26/01/13 14:28:34 INFO SparkContext: OS info Mac OS X, 26.2, aarch64\n",
      "26/01/13 14:28:34 INFO SparkContext: Java version 11.0.29\n",
      "26/01/13 14:28:34 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable\n",
      "Setting Spark log level to \"WARN\".\n",
      "26/01/13 14:28:35 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.\n",
      "26/01/13 14:28:35 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mspark\u001b[39m: \u001b[32mSparkSession\u001b[39m = org.apache.spark.sql.SparkSession@656e5f91\n",
       "\u001b[32mimport \u001b[39m\u001b[36mspark.implicits._\u001b[39m"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val spark = SparkSession\n",
    "                .builder()\n",
    "                .master(\"local[*]\")\n",
    "                .appName(\"SparkNeo4j\")\n",
    "                .config(\"spark.log.level\", \"WARN\")\n",
    "                .config(\"spark.jars.packages\", \"neo4j:neo4j-spark-connector:5.3.3-s_2.12\")\n",
    "                .config(\"neo4j.url\", \"neo4j://localhost:7687\")\n",
    "                .config(\"neo4j.authentication.type\", \"basic\")\n",
    "                .config(\"neo4j.authentication.basic.username\", \"neo4j\")\n",
    "                .config(\"neo4j.authentication.basic.password\", \"password\")\n",
    "                .getOrCreate()\n",
    "\n",
    "import spark.implicits._"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Read data from Neo4j into Spark"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "26/01/13 14:28:36 WARN SchemaService: Switching to query schema resolution\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mmovies\u001b[39m: \u001b[32mDataFrame\u001b[39m = [<id>: bigint, <labels>: array<string> ... 3 more fields]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val movies = spark.read\n",
    "                .format(\"org.neo4j.spark.DataSource\")\n",
    "                .option(\"labels\", \":Movie\")\n",
    "                .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- <id>: long (nullable = false)\n",
      " |-- <labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- title: string (nullable = true)\n",
      " |-- tagline: string (nullable = true)\n",
      " |-- released: long (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "movies.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
      "|<id>|<labels>|title                 |tagline                                                                                                                                                                      |released|\n",
      "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
      "|0   |[Movie] |The Matrix            |Welcome to the Real World                                                                                                                                                    |1999    |\n",
      "|9   |[Movie] |The Matrix Reloaded   |Free your mind                                                                                                                                                               |2003    |\n",
      "|10  |[Movie] |The Matrix Revolutions|Everything that has a beginning has an end                                                                                                                                   |2003    |\n",
      "|11  |[Movie] |The Devil's Advocate  |Evil has its winning ways                                                                                                                                                    |1997    |\n",
      "|15  |[Movie] |A Few Good Men        |In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.|1992    |\n",
      "|29  |[Movie] |Top Gun               |I feel the need, the need for speed.                                                                                                                                         |1986    |\n",
      "|37  |[Movie] |Jerry Maguire         |The rest of his life begins now.                                                                                                                                             |2000    |\n",
      "|46  |[Movie] |Stand By Me           |For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.                                |1986    |\n",
      "|52  |[Movie] |As Good as It Gets    |A comedy from the heart that goes for the throat.                                                                                                                            |1997    |\n",
      "|56  |[Movie] |What Dreams May Come  |After life there is more. The end is just the beginning.                                                                                                                     |1998    |\n",
      "+----+--------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "movies.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Person"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "26/01/13 14:28:39 WARN SchemaService: Switching to query schema resolution\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mperson\u001b[39m: \u001b[32mDataFrame\u001b[39m = [<id>: bigint, <labels>: array<string> ... 2 more fields]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val person = spark.read\n",
    "                .format(\"org.neo4j.spark.DataSource\")\n",
    "                .option(\"labels\", \":Person\")\n",
    "                .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- <id>: long (nullable = false)\n",
      " |-- <labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- born: long (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "person.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+--------+------------------+----+\n",
      "|<id>|<labels>|name              |born|\n",
      "+----+--------+------------------+----+\n",
      "|1   |[Person]|Keanu Reeves      |1964|\n",
      "|2   |[Person]|Carrie-Anne Moss  |1967|\n",
      "|3   |[Person]|Laurence Fishburne|1961|\n",
      "|4   |[Person]|Hugo Weaving      |1960|\n",
      "|5   |[Person]|Lilly Wachowski   |1967|\n",
      "|6   |[Person]|Lana Wachowski    |1965|\n",
      "|7   |[Person]|Joel Silver       |1952|\n",
      "|8   |[Person]|Emil Eifrem       |1978|\n",
      "|12  |[Person]|Charlize Theron   |1975|\n",
      "|13  |[Person]|Al Pacino         |1940|\n",
      "+----+--------+------------------+----+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "person.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ACTED_IN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "26/01/13 14:28:40 WARN SchemaService: Switching to query schema resolution\n",
      "26/01/13 14:28:40 WARN SchemaService: Switching to query schema resolution\n",
      "26/01/13 14:28:41 WARN SchemaService: Switching to query schema resolution\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mactedin\u001b[39m: \u001b[32mDataFrame\u001b[39m = [<rel.id>: bigint, <rel.type>: string ... 10 more fields]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val actedin = spark.read\n",
    "                .format(\"org.neo4j.spark.DataSource\")\n",
    "                .option(\"relationship\", \"ACTED_IN\")\n",
    "                .option(\"relationship.source.labels\", \":Person\")\n",
    "                .option(\"relationship.target.labels\", \":Movie\")\n",
    "                .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- <rel.id>: long (nullable = false)\n",
      " |-- <rel.type>: string (nullable = false)\n",
      " |-- <source.id>: long (nullable = false)\n",
      " |-- <source.labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- source.name: string (nullable = true)\n",
      " |-- source.born: long (nullable = true)\n",
      " |-- <target.id>: long (nullable = false)\n",
      " |-- <target.labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- target.title: string (nullable = true)\n",
      " |-- target.tagline: string (nullable = true)\n",
      " |-- target.released: long (nullable = true)\n",
      " |-- rel.roles: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actedin.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+----------------------+------------------------------------------+---------------+-------------+\n",
      "|<rel.id>|<rel.type>|<source.id>|<source.labels>|source.name       |source.born|<target.id>|<target.labels>|target.title          |target.tagline                            |target.released|rel.roles    |\n",
      "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+----------------------+------------------------------------------+---------------+-------------+\n",
      "|7       |ACTED_IN  |8          |[Person]       |Emil Eifrem       |1978       |0          |[Movie]        |The Matrix            |Welcome to the Real World                 |1999           |[Emil]       |\n",
      "|3       |ACTED_IN  |4          |[Person]       |Hugo Weaving      |1960       |0          |[Movie]        |The Matrix            |Welcome to the Real World                 |1999           |[Agent Smith]|\n",
      "|2       |ACTED_IN  |3          |[Person]       |Laurence Fishburne|1961       |0          |[Movie]        |The Matrix            |Welcome to the Real World                 |1999           |[Morpheus]   |\n",
      "|1       |ACTED_IN  |2          |[Person]       |Carrie-Anne Moss  |1967       |0          |[Movie]        |The Matrix            |Welcome to the Real World                 |1999           |[Trinity]    |\n",
      "|0       |ACTED_IN  |1          |[Person]       |Keanu Reeves      |1964       |0          |[Movie]        |The Matrix            |Welcome to the Real World                 |1999           |[Neo]        |\n",
      "|11      |ACTED_IN  |4          |[Person]       |Hugo Weaving      |1960       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                            |2003           |[Agent Smith]|\n",
      "|10      |ACTED_IN  |3          |[Person]       |Laurence Fishburne|1961       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                            |2003           |[Morpheus]   |\n",
      "|9       |ACTED_IN  |2          |[Person]       |Carrie-Anne Moss  |1967       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                            |2003           |[Trinity]    |\n",
      "|8       |ACTED_IN  |1          |[Person]       |Keanu Reeves      |1964       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                            |2003           |[Neo]        |\n",
      "|18      |ACTED_IN  |4          |[Person]       |Hugo Weaving      |1960       |10         |[Movie]        |The Matrix Revolutions|Everything that has a beginning has an end|2003           |[Agent Smith]|\n",
      "+--------+----------+-----------+---------------+------------------+-----------+-----------+---------------+----------------------+------------------------------------------+---------------+-------------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actedin.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DataFrame with nodes as map"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "26/01/13 14:28:42 WARN SchemaService: Switching to query schema resolution\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mactedinMap\u001b[39m: \u001b[32mDataFrame\u001b[39m = [<rel.id>: bigint, <rel.type>: string ... 3 more fields]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val actedinMap = spark.read\n",
    "                    .format(\"org.neo4j.spark.DataSource\")\n",
    "                    .option(\"relationship.nodes.map\", true)\n",
    "                    .option(\"relationship\", \"ACTED_IN\")\n",
    "                    .option(\"relationship.source.labels\", \":Person\")\n",
    "                    .option(\"relationship.target.labels\", \":Movie\")\n",
    "                    .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- <rel.id>: long (nullable = false)\n",
      " |-- <rel.type>: string (nullable = false)\n",
      " |-- <source>: map (nullable = false)\n",
      " |    |-- key: string\n",
      " |    |-- value: string (valueContainsNull = true)\n",
      " |-- <target>: map (nullable = false)\n",
      " |    |-- key: string\n",
      " |    |-- value: string (valueContainsNull = true)\n",
      " |-- rel.roles: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actedinMap.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+----------+-------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------+-------------+\n",
      "|<rel.id>|<rel.type>|<source>                                                                       |<target>                                                                                                                                         |rel.roles    |\n",
      "+--------+----------+-------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------+-------------+\n",
      "|7       |ACTED_IN  |{name -> \"Emil Eifrem\", born -> 1978, <labels> -> [\"Person\"], <id> -> 8}       |{title -> \"The Matrix\", released -> 1999, <labels> -> [\"Movie\"], <id> -> 0, tagline -> \"Welcome to the Real World\"}                              |[Emil]       |\n",
      "|3       |ACTED_IN  |{name -> \"Hugo Weaving\", born -> 1960, <labels> -> [\"Person\"], <id> -> 4}      |{title -> \"The Matrix\", released -> 1999, <labels> -> [\"Movie\"], <id> -> 0, tagline -> \"Welcome to the Real World\"}                              |[Agent Smith]|\n",
      "|2       |ACTED_IN  |{name -> \"Laurence Fishburne\", born -> 1961, <labels> -> [\"Person\"], <id> -> 3}|{title -> \"The Matrix\", released -> 1999, <labels> -> [\"Movie\"], <id> -> 0, tagline -> \"Welcome to the Real World\"}                              |[Morpheus]   |\n",
      "|1       |ACTED_IN  |{name -> \"Carrie-Anne Moss\", born -> 1967, <labels> -> [\"Person\"], <id> -> 2}  |{title -> \"The Matrix\", released -> 1999, <labels> -> [\"Movie\"], <id> -> 0, tagline -> \"Welcome to the Real World\"}                              |[Trinity]    |\n",
      "|0       |ACTED_IN  |{name -> \"Keanu Reeves\", born -> 1964, <labels> -> [\"Person\"], <id> -> 1}      |{title -> \"The Matrix\", released -> 1999, <labels> -> [\"Movie\"], <id> -> 0, tagline -> \"Welcome to the Real World\"}                              |[Neo]        |\n",
      "|11      |ACTED_IN  |{name -> \"Hugo Weaving\", born -> 1960, <labels> -> [\"Person\"], <id> -> 4}      |{title -> \"The Matrix Reloaded\", released -> 2003, <labels> -> [\"Movie\"], <id> -> 9, tagline -> \"Free your mind\"}                                |[Agent Smith]|\n",
      "|10      |ACTED_IN  |{name -> \"Laurence Fishburne\", born -> 1961, <labels> -> [\"Person\"], <id> -> 3}|{title -> \"The Matrix Reloaded\", released -> 2003, <labels> -> [\"Movie\"], <id> -> 9, tagline -> \"Free your mind\"}                                |[Morpheus]   |\n",
      "|9       |ACTED_IN  |{name -> \"Carrie-Anne Moss\", born -> 1967, <labels> -> [\"Person\"], <id> -> 2}  |{title -> \"The Matrix Reloaded\", released -> 2003, <labels> -> [\"Movie\"], <id> -> 9, tagline -> \"Free your mind\"}                                |[Trinity]    |\n",
      "|8       |ACTED_IN  |{name -> \"Keanu Reeves\", born -> 1964, <labels> -> [\"Person\"], <id> -> 1}      |{title -> \"The Matrix Reloaded\", released -> 2003, <labels> -> [\"Movie\"], <id> -> 9, tagline -> \"Free your mind\"}                                |[Neo]        |\n",
      "|18      |ACTED_IN  |{name -> \"Hugo Weaving\", born -> 1960, <labels> -> [\"Person\"], <id> -> 4}      |{title -> \"The Matrix Revolutions\", released -> 2003, <labels> -> [\"Movie\"], <id> -> 10, tagline -> \"Everything that has a beginning has an end\"}|[Agent Smith]|\n",
      "+--------+----------+-------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------+-------------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actedinMap.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Directed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "26/01/13 14:28:43 WARN SchemaService: Switching to query schema resolution\n",
      "26/01/13 14:28:43 WARN SchemaService: Switching to query schema resolution\n",
      "26/01/13 14:28:43 WARN SchemaService: Switching to query schema resolution\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\u001b[36mdirected\u001b[39m: \u001b[32mDataFrame\u001b[39m = [<rel.id>: bigint, <rel.type>: string ... 9 more fields]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val directed = spark.read\n",
    "                .format(\"org.neo4j.spark.DataSource\")\n",
    "                .option(\"relationship\", \"DIRECTED\")\n",
    "                .option(\"relationship.source.labels\", \":Person\")\n",
    "                .option(\"relationship.target.labels\", \":Movie\")\n",
    "                .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- <rel.id>: long (nullable = false)\n",
      " |-- <rel.type>: string (nullable = false)\n",
      " |-- <source.id>: long (nullable = false)\n",
      " |-- <source.labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- source.name: string (nullable = true)\n",
      " |-- source.born: long (nullable = true)\n",
      " |-- <target.id>: long (nullable = false)\n",
      " |-- <target.labels>: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- target.title: string (nullable = true)\n",
      " |-- target.tagline: string (nullable = true)\n",
      " |-- target.released: long (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "directed.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------+----------+-----------+---------------+---------------+-----------+-----------+---------------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------+\n",
      "|<rel.id>|<rel.type>|<source.id>|<source.labels>|source.name    |source.born|<target.id>|<target.labels>|target.title          |target.tagline                                                                                                                                                               |target.released|\n",
      "+--------+----------+-----------+---------------+---------------+-----------+-----------+---------------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------+\n",
      "|5       |DIRECTED  |6          |[Person]       |Lana Wachowski |1965       |0          |[Movie]        |The Matrix            |Welcome to the Real World                                                                                                                                                    |1999           |\n",
      "|4       |DIRECTED  |5          |[Person]       |Lilly Wachowski|1967       |0          |[Movie]        |The Matrix            |Welcome to the Real World                                                                                                                                                    |1999           |\n",
      "|13      |DIRECTED  |6          |[Person]       |Lana Wachowski |1965       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                                                                                                                                                               |2003           |\n",
      "|12      |DIRECTED  |5          |[Person]       |Lilly Wachowski|1967       |9          |[Movie]        |The Matrix Reloaded   |Free your mind                                                                                                                                                               |2003           |\n",
      "|20      |DIRECTED  |6          |[Person]       |Lana Wachowski |1965       |10         |[Movie]        |The Matrix Revolutions|Everything that has a beginning has an end                                                                                                                                   |2003           |\n",
      "|19      |DIRECTED  |5          |[Person]       |Lilly Wachowski|1967       |10         |[Movie]        |The Matrix Revolutions|Everything that has a beginning has an end                                                                                                                                   |2003           |\n",
      "|25      |DIRECTED  |14         |[Person]       |Taylor Hackford|1944       |11         |[Movie]        |The Devil's Advocate  |Evil has its winning ways                                                                                                                                                    |1997           |\n",
      "|38      |DIRECTED  |27         |[Person]       |Rob Reiner     |1947       |15         |[Movie]        |A Few Good Men        |In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.|1992           |\n",
      "|46      |DIRECTED  |35         |[Person]       |Tony Scott     |1944       |29         |[Movie]        |Top Gun               |I feel the need, the need for speed.                                                                                                                                         |1986           |\n",
      "|57      |DIRECTED  |45         |[Person]       |Cameron Crowe  |1957       |37         |[Movie]        |Jerry Maguire         |The rest of his life begins now.                                                                                                                                             |2000           |\n",
      "+--------+----------+-----------+---------------+---------------+-----------+-----------+---------------+----------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "directed.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Read arbitrary data via Cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mcypher\u001b[39m: \u001b[32mDataFrame\u001b[39m = [Recommended: string, Strength: bigint]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val cypher = spark.read\n",
    "                .format(\"org.neo4j.spark.DataSource\")\n",
    "                .option(\"query\", \"\"\"\n",
    "                    // Extend Tom Hanks co-actors, to find co-co-actors who haven't worked with Tom Hanks\n",
    "                    MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors),\n",
    "                    (coActors)-[:ACTED_IN]->(m2)<-[:ACTED_IN]-(cocoActors)\n",
    "                    WHERE NOT (tom)-[:ACTED_IN]->()<-[:ACTED_IN]-(cocoActors)\n",
    "                        AND tom <> cocoActors\n",
    "                    RETURN cocoActors.name AS Recommended, count(*) AS Strength\n",
    "                    ORDER BY Strength DESC\n",
    "                    \"\"\")\n",
    "                .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- Recommended: string (nullable = true)\n",
      " |-- Strength: long (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "cypher.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----------------+--------+\n",
      "|Recommended     |Strength|\n",
      "+----------------+--------+\n",
      "|Zach Grenier    |5       |\n",
      "|Tom Cruise      |5       |\n",
      "|Cuba Gooding Jr.|4       |\n",
      "|Keanu Reeves    |4       |\n",
      "|Kelly McGillis  |3       |\n",
      "|Tom Skerritt    |3       |\n",
      "|Billy Crystal   |3       |\n",
      "|Jack Nicholson  |3       |\n",
      "|Val Kilmer      |3       |\n",
      "|Anthony Edwards |3       |\n",
      "+----------------+--------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "cypher.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Return all the actors that have also directed a movie."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mactorsDirectors\u001b[39m: \u001b[32mDataFrame\u001b[39m = [name: string, acted_in: array<string> ... 1 more field]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val actorsDirectors = spark.read\n",
    "                        .format(\"org.neo4j.spark.DataSource\")\n",
    "                        .option(\"query\", \"\"\"\n",
    "                                MATCH (p:Person)\n",
    "                                MATCH (p)-[:ACTED_IN]->(m:Movie)\n",
    "                                MATCH (p)-[:DIRECTED]->(m1:Movie)\n",
    "                                RETURN p.name AS name, collect(m.title) AS acted_in, collect(m1.title) AS directed\n",
    "                                \"\"\")\n",
    "                        .load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- name: string (nullable = true)\n",
      " |-- acted_in: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- directed: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actorsDirectors.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+\n",
      "|name          |acted_in                                                                                                                                                                                                                |directed                                                                                                                                                                                                                            |\n",
      "+--------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+\n",
      "|Tom Hanks     |[Apollo 13, You've Got Mail, A League of Their Own, Joe Versus the Volcano, That Thing You Do, The Da Vinci Code, Cloud Atlas, Cast Away, The Green Mile, Sleepless in Seattle, The Polar Express, Charlie Wilson's War]|[That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do, That Thing You Do]|\n",
      "|Werner Herzog |[What Dreams May Come]                                                                                                                                                                                                  |[RescueDawn]                                                                                                                                                                                                                        |\n",
      "|Clint Eastwood|[Unforgiven]                                                                                                                                                                                                            |[Unforgiven]                                                                                                                                                                                                                        |\n",
      "|James Marshall|[A Few Good Men, A Few Good Men]                                                                                                                                                                                        |[V for Vendetta, Ninja Assassin]                                                                                                                                                                                                    |\n",
      "|Danny DeVito  |[Hoffa, One Flew Over the Cuckoo's Nest]                                                                                                                                                                                |[Hoffa, Hoffa]                                                                                                                                                                                                                      |\n",
      "+--------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actorsDirectors.show(10, false)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Write data from Spark to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mproducts\u001b[39m: \u001b[32mDataFrame\u001b[39m = [id: int, name: string ... 1 more field]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val products = spark.read\n",
    "                .format(\"csv\")\n",
    "                .option(\"inferSchema\", true)\n",
    "                .load(\"desktop-csv-import/products.csv\")\n",
    "                .withColumnsRenamed(Map(\"_c0\" -> \"id\", \"_c1\" -> \"name\", \"_c2\" -> \"price\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- id: integer (nullable = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- price: double (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "products.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---+-------------------------------+-----+\n",
      "|id |name                           |price|\n",
      "+---+-------------------------------+-----+\n",
      "|1  |Chai                           |18.0 |\n",
      "|2  |Chang                          |19.0 |\n",
      "|3  |Aniseed Syrup                  |10.0 |\n",
      "|4  |Chef Anton's Cajun Seasoning   |22.0 |\n",
      "|5  |Chef Anton's Gumbo Mix         |21.35|\n",
      "|6  |Grandma's Boysenberry Spread   |25.0 |\n",
      "|7  |Uncle Bob's Organic Dried Pears|30.0 |\n",
      "|8  |Northwoods Cranberry Sauce     |40.0 |\n",
      "|9  |Mishi Kobe Niku                |97.0 |\n",
      "|10 |Ikura                          |31.0 |\n",
      "+---+-------------------------------+-----+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "products.show(10, false)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mres29\u001b[39m: \u001b[32mLong\u001b[39m = \u001b[32m77L\u001b[39m"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "products.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36morders\u001b[39m: \u001b[32mDataFrame\u001b[39m = [id: int, date: timestamp ... 1 more field]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val orders = spark.read\n",
    "                .format(\"csv\")\n",
    "                .option(\"inferSchema\", true)\n",
    "                .option(\"header\", true)\n",
    "                .load(\"desktop-csv-import/orders.csv\")\n",
    "                .selectExpr(\"orderID AS id\", \"CAST(orderDate AS TIMESTAMP) AS date\", \"shipCountry\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- id: integer (nullable = true)\n",
      " |-- date: timestamp (nullable = true)\n",
      " |-- shipCountry: string (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "orders.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----+-------------------+-----------+\n",
      "|id   |date               |shipCountry|\n",
      "+-----+-------------------+-----------+\n",
      "|10248|1996-07-04 00:00:00|France     |\n",
      "|10249|1996-07-05 00:00:00|Germany    |\n",
      "|10250|1996-07-08 00:00:00|Brazil     |\n",
      "|10251|1996-07-08 00:00:00|France     |\n",
      "|10252|1996-07-09 00:00:00|Belgium    |\n",
      "|10253|1996-07-10 00:00:00|Brazil     |\n",
      "|10254|1996-07-11 00:00:00|Switzerland|\n",
      "|10255|1996-07-12 00:00:00|Switzerland|\n",
      "|10256|1996-07-15 00:00:00|Brazil     |\n",
      "|10257|1996-07-16 00:00:00|Venezuela  |\n",
      "+-----+-------------------+-----------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "orders.show(10, false)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mres33\u001b[39m: \u001b[32mLong\u001b[39m = \u001b[32m830L\u001b[39m"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orders.count()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write nodes via label option"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "products.write\n",
    "        .format(\"org.neo4j.spark.DataSource\")\n",
    "        .mode(\"overwrite\")\n",
    "        .option(\"labels\", \":Product\")\n",
    "        .option(\"node.keys\", \"id\")\n",
    "        .save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "orders.write\n",
    "      .format(\"org.neo4j.spark.DataSource\")\n",
    "      .mode(\"overwrite\")\n",
    "      .option(\"labels\", \":Order\")\n",
    "      .option(\"node.keys\", \"id\")\n",
    "      .save()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write relationships via relationship option"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36morderDetails\u001b[39m: \u001b[32mDataFrame\u001b[39m = [orderID: int, productID: int ... 1 more field]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val orderDetails = spark.read\n",
    "                    .format(\"csv\")\n",
    "                    .option(\"inferSchema\", true)\n",
    "                    .option(\"header\", true)\n",
    "                    .load(\"desktop-csv-import/order-details.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- orderID: integer (nullable = true)\n",
      " |-- productID: integer (nullable = true)\n",
      " |-- quantity: integer (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "orderDetails.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-------+---------+--------+\n",
      "|orderID|productID|quantity|\n",
      "+-------+---------+--------+\n",
      "|10248  |11       |12      |\n",
      "|10248  |42       |10      |\n",
      "|10248  |72       |5       |\n",
      "|10249  |14       |9       |\n",
      "|10249  |51       |40      |\n",
      "|10250  |41       |10      |\n",
      "|10250  |51       |35      |\n",
      "|10250  |65       |15      |\n",
      "|10251  |22       |6       |\n",
      "|10251  |57       |15      |\n",
      "+-------+---------+--------+\n",
      "only showing top 10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "orderDetails.show(10, false)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mres39\u001b[39m: \u001b[32mLong\u001b[39m = \u001b[32m2155L\u001b[39m"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orderDetails.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "orderDetails.write\n",
    "            .format(\"org.neo4j.spark.DataSource\")\n",
    "            .mode(\"overwrite\")\n",
    "            .option(\"relationship\", \"CONTAINS\")\n",
    "            .option(\"relationship.save.strategy\", \"keys\")\n",
    "            .option(\"relationship.source.labels\", \":Product\")\n",
    "            .option(\"relationship.source.save.mode\", \"Match\")\n",
    "            .option(\"relationship.source.node.keys\", \"productID:id\")\n",
    "            .option(\"relationship.target.labels\", \":Order\")\n",
    "            .option(\"relationship.target.save.mode\", \"Match\")\n",
    "            .option(\"relationship.target.node.keys\", \"orderID:id\")\n",
    "            .option(\"relationship.properties\", \"quantity:quantityOrdered\")\n",
    "            .save()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write custom graphs via Cypher Query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mactorOrders\u001b[39m: \u001b[32mSeq\u001b[39m[(\u001b[32mString\u001b[39m, \u001b[32mInt\u001b[39m, \u001b[32mArray\u001b[39m[\u001b[32mInt\u001b[39m], \u001b[32mArray\u001b[39m[\u001b[32mInt\u001b[39m], \u001b[32mString\u001b[39m)] = \u001b[33mList\u001b[39m(\n",
       "  (\n",
       "    \u001b[32m\"Cuba Gooding Jr.\"\u001b[39m,\n",
       "    \u001b[32m1\u001b[39m,\n",
       "    \u001b[33mArray\u001b[39m(\u001b[32m11\u001b[39m, \u001b[32m42\u001b[39m, \u001b[32m72\u001b[39m),\n",
       "    \u001b[33mArray\u001b[39m(\u001b[32m1\u001b[39m, \u001b[32m2\u001b[39m, \u001b[32m3\u001b[39m),\n",
       "    \u001b[32m\"2022-06-07 00:00:00\"\u001b[39m\n",
       "  ),\n",
       "  (\u001b[32m\"Tom Hanks\"\u001b[39m, \u001b[32m2\u001b[39m, \u001b[33mArray\u001b[39m(\u001b[32m24\u001b[39m, \u001b[32m55\u001b[39m, \u001b[32m75\u001b[39m), \u001b[33mArray\u001b[39m(\u001b[32m3\u001b[39m, \u001b[32m2\u001b[39m, \u001b[32m1\u001b[39m), \u001b[32m\"2022-06-06 00:00:00\"\u001b[39m)\n",
       ")"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val actorOrders = Seq(\n",
    "  (\"Cuba Gooding Jr.\", 1, Array(11, 42, 72), Array(1, 2, 3), \"2022-06-07 00:00:00\"),\n",
    "  (\"Tom Hanks\", 2, Array(24, 55, 75), Array(3, 2, 1), \"2022-06-06 00:00:00\")\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[36mactorOrdersDF\u001b[39m: \u001b[32mDataFrame\u001b[39m = [actor_name: string, order_id: int ... 3 more fields]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "val actorOrdersDF = spark\n",
    "                    .createDataFrame(actorOrders)\n",
    "                    .withColumnsRenamed(\n",
    "                        Map(\n",
    "                            \"_1\" -> \"actor_name\",\n",
    "                            \"_2\" -> \"order_id\",\n",
    "                            \"_3\" -> \"products\",\n",
    "                            \"_4\" -> \"quantities\",\n",
    "                            \"_5\" -> \"order_date\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- actor_name: string (nullable = true)\n",
      " |-- order_id: integer (nullable = false)\n",
      " |-- products: array (nullable = true)\n",
      " |    |-- element: integer (containsNull = false)\n",
      " |-- quantities: array (nullable = true)\n",
      " |    |-- element: integer (containsNull = false)\n",
      " |-- order_date: string (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actorOrdersDF.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----------------+--------+------------+----------+-------------------+\n",
      "|actor_name      |order_id|products    |quantities|order_date         |\n",
      "+----------------+--------+------------+----------+-------------------+\n",
      "|Cuba Gooding Jr.|1       |[11, 42, 72]|[1, 2, 3] |2022-06-07 00:00:00|\n",
      "|Tom Hanks       |2       |[24, 55, 75]|[3, 2, 1] |2022-06-06 00:00:00|\n",
      "+----------------+--------+------------+----------+-------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "actorOrdersDF.show(10, false)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "actorOrdersDF.write\n",
    "             .format(\"org.neo4j.spark.DataSource\")\n",
    "             .mode(\"overwrite\")\n",
    "             .option(\"query\", \"\"\"\n",
    "                     MATCH (person:Person {name: event.actor_name})\n",
    "                     MERGE (order:Order {id: event.order_id, date: datetime(replace(event.order_date, ' ', 'T'))})\n",
    "                     MERGE (person)-[:CREATED]->(order)\n",
    "                     WITH event, order\n",
    "                     UNWIND range(0, size(event.products) - 1) AS index\n",
    "                     MATCH (product:Product {id: event.products[index]})\n",
    "                     MERGE (product)-[:CONTAINS{quantityOrdered: event.quantities[index]}]->(order)\n",
    "                    \"\"\")\n",
    "             .save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Scala (2.12)",
   "language": "scala",
   "name": "scala212"
  },
  "language_info": {
   "codemirror_mode": "text/x-scala",
   "file_extension": ".sc",
   "mimetype": "text/x-scala",
   "name": "scala",
   "nbconvert_exporter": "script",
   "version": "2.12.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
